Autodesk.Revit.DB.MarginType
An enumerated type listing all Margin types of Print Setting.

Autodesk.Revit.DB.MarginType.UserDefined
The type of Margin is User Defined .

Autodesk.Revit.DB.MarginType.PrinterLimit
The type of Margin is Printer Limit.

Autodesk.Revit.DB.MarginType.NoMargin
The type of Margin is No Margin.